Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetRebarComplexGeometries Method (Boolean, Boolean, Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarComplexGeometry). These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view. RebarComplexGeometry only differs from RebarGeometry by containing a polycurve rather than a polyline.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<RebarComplexGeometry> GetRebarComplexGeometries(
	bool withHooks,
	bool withoutClashes,
	bool lengthAdjustments
)
Public Function GetRebarComplexGeometries (
	withHooks As Boolean,
	withoutClashes As Boolean,
	lengthAdjustments As Boolean
) As List(Of RebarComplexGeometry)
Parameters
withHooks
Type: System.Boolean
A parameter to determine whether the hook points should be included in the rebar geometry or not.
withoutClashes
Type: System.Boolean
A parameter to determine whether self-clash avoidance should be included in the rebar geometry or not.
lengthAdjustments
Type: System.Boolean
A parameter to determine whether rounding and step tapering should be included in the rebar geometry or not.
Return Value
Type: List<RebarComplexGeometry>
A list of RebarComplexGeometrys.
See Also
Reference
Reinforcement Class
GetRebarComplexGeometries Overload
Tekla.Structures.Model Namespace